Notebook is copyright &copy; of <a href="https://ajaytech.co">Ajay Tech</a>. You can find an online version of the same at <a href="https://ajaytech.co/just-enough-sql">Just Enough SQL</a>

# Just enough SQL

## Contents

- SQL
  - What is a Database
  - What is SQL
- SQL Connectors
- Selecting Data
  - SELECT Statement
  - Aggregate Functions
  - Join Statements
    - Inner Join
    - Outer Join
    - Left Outer Join
    - Right Outer Join
- Keys
  - Primary Key / Foreign Key
- SQL with Pandas

## SQL

**SQL** stands for Structured Query Language. It is the language of Relational databases. So, before we understand _SQL_, let's understand what a **Relational** database is. The next couple of pages would introduce databases at a very high level.

### What is a Database

A database is a software that is used to store data. There are many types of databases (relational, graph, document etc) but we are going to focus only on **relational** database as it is the most popular database format. Also, SQL is specifically used for relational databases. 

Relational databases comprise of data in tabular format. For example, let's see how an employee's data could be structured in a relational database.

<img src="./pics/employee-data-sample.png"/>

This is how we humans would like to see data. However, it is not scalable to store large amounts of data in a way that is more suitable for fast read and writes. That is where the concept of data normalization comes in. Normalization is a subject in itself and we will not be discussing it here. However, the process is pretty intuitive overall. Here is how the same data would be structured in a good database.

<img src="./pics/normalized-data.png"/>

There are many databases in use today. For example, MySQL, Oracle, Microsoft SQL Server, PostgreSQL etc. In this chapter, we will be focussing on the MySQL database. Here is a quick instruction set on <a href="https://ajaytech.co/my-sql-installation/"> How to install MySQL Database</a>. 

By default MySQL database comes with very few data tables. MySQL provides a big _employee_ database (with 300K employee records) that you can download from the web and upload onto your database. You can use it to practice data extraction. The data above is taken from that employee database.

### What is SQL

**SQL** is the language of relational databases. It can be used to create, extract, manipulate and delete data in the database. For example, here is a quick SQL to extract the first 10 rows of data from a database table EMPLOYEES.

SELECT * FROM employees LIMIT 10;

<img src="./pics/employees_table_data.png"/>

The "\*" indicates that all columns need to be selected. As you can see, the syntax is pretty intuitive. It is deliberately designed to be like English.

## SQL Connectors

Like discussed previously, there are a variety of databases. Each of these databases has a specific connector and you have to install it. Since we will be working with MySQL database, we will install MySQL connector.

<pre>
pip install mysql-connector
</pre>

Typically, you will be given the database details like below. 

<pre>
Server Address : xx.xx.xx.xx
port           : 33xx
schema         : xxxx

user id        : xxxx
password       : xxxx
</pre>

In [3]:
import mysql.connector

db = mysql.connector.connect(
  host     = "localhost",
  user     = "ajaytech",
  passwd   = "ajaytech"
)

InterfaceError: 2003: Can't connect to MySQL server on 'localhost:3306' (10061 No connection could be made because the target machine actively refused it)

Database interactions are typically retrieved using something called a **cursor**. A Cursor is just a pointer to a set of data retrieved from the database. It is upto us to iterate over the retrieved data and get what we went. Typically this is done using a loop. So, this is basically a 2 step process

1. *Execute an SQL statement and get the result into a cursor*
2. *Iterate over the cursor to get the data*

For example, let's do these 2 steps to list all the databases. Each database is essentially a collection of tables.

**Step 1** - Get the list of tables into a cursor

In [3]:
cur = db.cursor()

cur.execute("SHOW DATABASES")

**Step 2** - Iterate over the cursor to get the list of databases

In [4]:
for db in cur:
  print(db)

('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

Once we know the list of databases, we have to select the database first. Once we do that, we can freely go about executing the **select** statements on that particular database.

In [6]:
cur.execute("use world")

List all the tables in the database.

In [10]:
cur.execute("show tables")

In [11]:
for table in cur:
  print(table)

('city',)
('country',)
('countrylanguage',)

Let's pick a table - say **country**. Now, let's extract all the columns in that table. They will become the columns of our Pandas dataframe.

In [37]:
cur.execute("show columns from country")

In [38]:
column_names = []
for column in cur:
  column_names.append(column[0])

columns

['Code',
 'Name',
 'Continent',
 'Region',
 'SurfaceArea',
 'IndepYear',
 'Population',
 'LifeExpectancy',
 'GNP',
 'GNPOld',
 'LocalName',
 'GovernmentForm',
 'HeadOfState',
 'Capital',
 'Code2']

Once we got the column names, let's get the actual data from the table.

In [52]:
cur.execute("select * from country")

In [53]:
import pandas as pd

country_data = pd.DataFrame(columns = column_names)

rows = []
for data in cur:
  rows.append(list(data))

country_data = pd.DataFrame(rows)

In [55]:
country_data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,JosÃ© Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,ShqipÃ«ria,Republic,Rexhep Mejdani,34.0,AL

Great !!! We just need one last step before we finish creating the table into a Pandas dataframe. Set the column names that we have already extracted in a previous step.

In [57]:
country_data.columns = column_names

country_data.head()

,Code,Name,Continent,Region,SurfaceArea,IndepYear,Population,LifeExpectancy,GNP,GNPOld,LocalName,GovernmentForm,HeadOfState,Capital,Code2
0,ABW,Aruba,North America,Caribbean,193.0,NaN,103000,78.4,828.0,793.0,Aruba,Nonmetropolitan Territory of The Netherlands,Beatrix,129.0,AW
1,AFG,Afghanistan,Asia,Southern and Central Asia,652090.0,1919.0,22720000,45.9,5976.0,NaN,Afganistan/Afqanestan,Islamic Emirate,Mohammad Omar,1.0,AF
2,AGO,Angola,Africa,Central Africa,1246700.0,1975.0,12878000,38.3,6648.0,7984.0,Angola,Republic,JosÃ© Eduardo dos Santos,56.0,AO
3,AIA,Anguilla,North America,Caribbean,96.0,NaN,8000,76.1,63.2,NaN,Anguilla,Dependent Territory of the UK,Elisabeth II,62.0,AI
4,ALB,Albania,Europe,Southern Europe,28748.0,1912.0,3401200,71.6,3205.0,2500.0,ShqipÃ«ria,Republic,Rexhep Mejdani,34.0,AL

Instead of going the **cursor** route, you can also choose an ORM that can abstract the meta associated with the database table. A detailed description of an ORM is once again a subject in itself and we will not be discussing it today. 

ORM stands for **Object Relational Mapper**. Instead of just focusing on SQL, ORM lets us use any Object Oriented paradigm to extract data from a relational database. Just think of ORM as a OO wrapper around SQL. Here is a quick visual to show the same.

<img src="./pics/orm-database-visual.png"/>

One such ORM is **SQLAlchemy**.

<pre>
pip install SQLAlchemy
</pre>

In [ ]:
import pandas as pd
import mysql.connector

import sqlalchemy as db

engine = db.create_engine('dialect+driver://ajaytech:ajaytech@host:port/db')

### Selecting Data

For the purpose of extracting data for Data Science & Machine Learning, we will mostly be working with **SELECTING** data. So, our focus will mainly be on selecting data (as opposed to UPDATEs, DELETEs or CREATE or other administrative aspects of the database).

#### SELECT Statement

This is probably the most used SQL statement in Data Science or otherwise. We have seen an example of how to select data from the country table above. In the following sections, we will focus on the employees database and how to extract data from the tables inside it.

Here is a snapshot of the SELECT statement syntax in it's most generic format. As you can see, it is pretty intense.

<img src="./pics/select-statement-syntax.png"/>

Luckily, we